---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NoSelectedInOption
source: html/6067869c-3d6f-aecd-ba4f-7df0974c0d3f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.NoSelectedInOption Property

None of the selected elements can be added to this Option Set. The following warnings provide additional information.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSelectedInOption { get; }
```